ctag-fh-kiel/ctag-tbd/sdkconfig.defaults
#
# Automatically generated file. DO NOT EDIT.
# Espressif IoT Development Framework (ESP-IDF) 6.0.1 Project Configuration
#
# default:
CONFIG_SOC_ADC_SUPPORTED=y
# default:
CONFIG_SOC_ANA_CMPR_SUPPORTED=y
# default:
CONFIG_SOC_DEDICATED_GPIO_SUPPORTED=y
# default:
CONFIG_SOC_UART_SUPPORTED=y
# default:
CONFIG_SOC_GDMA_SUPPORTED=y
# default:
CONFIG_SOC_UHCI_SUPPORTED=y
# default:
CONFIG_SOC_AHB_GDMA_SUPPORTED=y
# default:
CONFIG_SOC_AXI_GDMA_SUPPORTED=y
# default:
CONFIG_SOC_DW_GDMA_SUPPORTED=y
# default:
CONFIG_SOC_DMA2D_SUPPORTED=y
# default:
CONFIG_SOC_GPTIMER_SUPPORTED=y
# default:
CONFIG_SOC_PCNT_SUPPORTED=y
# default:
CONFIG_SOC_LCDCAM_CAM_SUPPORTED=y
# default:
CONFIG_SOC_LCDCAM_I80_LCD_SUPPORTED=y
# default:
CONFIG_SOC_LCDCAM_RGB_LCD_SUPPORTED=y
# default:
CONFIG_SOC_LCD_I80_SUPPORTED=y
# default:
CONFIG_SOC_LCD_RGB_SUPPORTED=y
# default:
CONFIG_SOC_MIPI_CSI_SUPPORTED=y
# default:
CONFIG_SOC_MIPI_DSI_SUPPORTED=y
# default:
CONFIG_SOC_MCPWM_SUPPORTED=y
# default:
CONFIG_SOC_TWAI_SUPPORTED=y
# default:
CONFIG_SOC_ETM_SUPPORTED=y
# default:
CONFIG_SOC_PARLIO_SUPPORTED=y
# default:
CONFIG_SOC_PARLIO_LCD_SUPPORTED=y
# default:
CONFIG_SOC_ASYNC_MEMCPY_SUPPORTED=y
# default:
CONFIG_SOC_EMAC_SUPPORTED=y
# default:
CONFIG_SOC_USB_OTG_SUPPORTED=y
# default:
CONFIG_SOC_WIRELESS_HOST_SUPPORTED=y
# default:
CONFIG_SOC_USB_SERIAL_JTAG_SUPPORTED=y
# default:
CONFIG_SOC_TEMP_SENSOR_SUPPORTED=y
# default:
CONFIG_SOC_SUPPORTS_SECURE_DL_MODE=y
# default:
CONFIG_SOC_ULP_SUPPORTED=y
# default:
CONFIG_SOC_LP_CORE_SUPPORTED=y
# default:
CONFIG_SOC_EFUSE_KEY_PURPOSE_FIELD=y
# default:
CONFIG_SOC_EFUSE_SUPPORTED=y
# default:
CONFIG_SOC_RTC_FAST_MEM_SUPPORTED=y
# default:
CONFIG_SOC_RTC_MEM_SUPPORTED=y
# default:
CONFIG_SOC_RMT_SUPPORTED=y
# default:
CONFIG_SOC_I2S_SUPPORTED=y
# default:
CONFIG_SOC_SDM_SUPPORTED=y
# default:
CONFIG_SOC_GPSPI_SUPPORTED=y
# default:
CONFIG_SOC_LEDC_SUPPORTED=y
# default:
CONFIG_SOC_ISP_SUPPORTED=y
# default:
CONFIG_SOC_I2C_SUPPORTED=y
# default:
CONFIG_SOC_SYSTIMER_SUPPORTED=y
# default:
CONFIG_SOC_AES_SUPPORTED=y
# default:
CONFIG_SOC_MPI_SUPPORTED=y
# default:
CONFIG_SOC_SHA_SUPPORTED=y
# default:
CONFIG_SOC_HMAC_SUPPORTED=y
# default:
CONFIG_SOC_DIG_SIGN_SUPPORTED=y
# default:
CONFIG_SOC_ECC_SUPPORTED=y
# default:
CONFIG_SOC_ECC_EXTENDED_MODES_SUPPORTED=y
# default:
CONFIG_SOC_ECDSA_SUPPORTED=y
# default:
CONFIG_SOC_KEY_MANAGER_SUPPORTED=y
# default:
CONFIG_SOC_HUK_SUPPORTED=y
# default:
CONFIG_SOC_FLASH_ENC_SUPPORTED=y
# default:
CONFIG_SOC_SECURE_BOOT_SUPPORTED=y
# default:
CONFIG_SOC_BOD_SUPPORTED=y
# default:
CONFIG_SOC_VBAT_SUPPORTED=y
# default:
CONFIG_SOC_APM_SUPPORTED=y
# default:
CONFIG_SOC_PMU_SUPPORTED=y
# default:
CONFIG_SOC_PMU_PVT_SUPPORTED=y
# default:
CONFIG_SOC_PVT_EN_WITH_SLEEP=y
# default:
CONFIG_SOC_PVT_RETENTION_BY_REGDMA=y
# default:
CONFIG_SOC_DCDC_SUPPORTED=y
# default:
CONFIG_SOC_PAU_SUPPORTED=y
# default:
CONFIG_SOC_RTC_TIMER_V2_SUPPORTED=y
# default:
CONFIG_SOC_ULP_LP_UART_SUPPORTED=y
# default:
CONFIG_SOC_LP_GPIO_MATRIX_SUPPORTED=y
# default:
CONFIG_SOC_LP_PERIPHERALS_SUPPORTED=y
# default:
CONFIG_SOC_LP_I2C_SUPPORTED=y
# default:
CONFIG_SOC_LP_I2S_SUPPORTED=y
# default:
CONFIG_SOC_LP_SPI_SUPPORTED=y
# default:
CONFIG_SOC_LP_ADC_SUPPORTED=y
# default:
CONFIG_SOC_LP_VAD_SUPPORTED=y
# default:
CONFIG_SOC_LP_MAILBOX_SUPPORTED=y
# default:
CONFIG_SOC_SPIRAM_SUPPORTED=y
# default:
CONFIG_SOC_PSRAM_DMA_CAPABLE=y
# default:
CONFIG_SOC_SDMMC_HOST_SUPPORTED=y
# default:
CONFIG_SOC_CLK_TREE_SUPPORTED=y
# default:
CONFIG_SOC_ASSIST_DEBUG_SUPPORTED=y
# default:
CONFIG_SOC_DEBUG_PROBE_SUPPORTED=y
# default:
CONFIG_SOC_WDT_SUPPORTED=y
# default:
CONFIG_SOC_SPI_FLASH_SUPPORTED=y
# default:
CONFIG_SOC_TOUCH_SENSOR_SUPPORTED=y
# default:
CONFIG_SOC_RNG_SUPPORTED=y
# default:
CONFIG_SOC_GP_LDO_SUPPORTED=y
# default:
CONFIG_SOC_PPA_SUPPORTED=y
# default:
CONFIG_SOC_LIGHT_SLEEP_SUPPORTED=y
# default:
CONFIG_SOC_DEEP_SLEEP_SUPPORTED=y
# default:
CONFIG_SOC_PM_SUPPORTED=y
# default:
CONFIG_SOC_BITSCRAMBLER_SUPPORTED=y
# default:
CONFIG_SOC_SIMD_INSTRUCTION_SUPPORTED=y
# default:
CONFIG_SOC_I3C_MASTER_SUPPORTED=y
# default:
CONFIG_SOC_XTAL_SUPPORT_40M=y
# default:
CONFIG_SOC_AES_SUPPORT_DMA=y
# default:
CONFIG_SOC_AES_SUPPORT_GCM=y
# default:
CONFIG_SOC_AES_GDMA=y
# default:
CONFIG_SOC_AES_SUPPORT_AES_128=y
# default:
CONFIG_SOC_AES_SUPPORT_AES_256=y
# default:
CONFIG_SOC_AES_SUPPORT_PSEUDO_ROUND_FUNCTION=y
# default:
CONFIG_SOC_ADC_RTC_CTRL_SUPPORTED=y
# default:
CONFIG_SOC_ADC_DIG_CTRL_SUPPORTED=y
# default:
CONFIG_SOC_ADC_DMA_SUPPORTED=y
# default:
CONFIG_SOC_ADC_PERIPH_NUM=2
# default:
CONFIG_SOC_ADC_MAX_CHANNEL_NUM=8
# default:
CONFIG_SOC_ADC_ATTEN_NUM=4
# default:
CONFIG_SOC_ADC_DIGI_CONTROLLER_NUM=2
# default:
CONFIG_SOC_ADC_PATT_LEN_MAX=16
# default:
CONFIG_SOC_ADC_DIGI_MAX_BITWIDTH=12
# default:
CONFIG_SOC_ADC_DIGI_MIN_BITWIDTH=12
# default:
CONFIG_SOC_ADC_DIGI_IIR_FILTER_NUM=2
# default:
CONFIG_SOC_ADC_DIGI_MONITOR_NUM=2
# default:
CONFIG_SOC_ADC_DIGI_RESULT_BYTES=4
# default:
CONFIG_SOC_ADC_DIGI_DATA_BYTES_PER_CONV=4
# default:
CONFIG_SOC_ADC_SAMPLE_FREQ_THRES_HIGH=83333
# default:
CONFIG_SOC_ADC_SAMPLE_FREQ_THRES_LOW=611
# default:
CONFIG_SOC_ADC_RTC_MIN_BITWIDTH=12
# default:
CONFIG_SOC_ADC_RTC_MAX_BITWIDTH=12
# default:
CONFIG_SOC_ADC_CALIBRATION_V1_SUPPORTED=y
# default:
CONFIG_SOC_ADC_SELF_HW_CALI_SUPPORTED=y
# default:
CONFIG_SOC_ADC_CALIB_CHAN_COMPENS_SUPPORTED=y
# default:
CONFIG_SOC_ADC_SHARED_POWER=y
# default:
CONFIG_SOC_BROWNOUT_RESET_SUPPORTED=y
# default:
CONFIG_SOC_SHARED_IDCACHE_SUPPORTED=y
# default:
CONFIG_SOC_CACHE_WRITEBACK_SUPPORTED=y
# default:
CONFIG_SOC_CACHE_FREEZE_SUPPORTED=y
# default:
CONFIG_SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE=y
# default:
CONFIG_SOC_CPU_CORES_NUM=2
# default:
CONFIG_SOC_CPU_INTR_NUM=32
# default:
CONFIG_SOC_CPU_HAS_FLEXIBLE_INTC=y
# default:
CONFIG_SOC_INT_CLIC_SUPPORTED=y
# default:
CONFIG_SOC_INT_HW_NESTED_SUPPORTED=y
# default:
CONFIG_SOC_BRANCH_PREDICTOR_SUPPORTED=y
# default:
CONFIG_SOC_CPU_COPROC_NUM=3
# default:
CONFIG_SOC_CPU_HAS_FPU=y
# default:
CONFIG_SOC_CPU_HAS_FPU_EXT_ILL_BUG=y
# default:
CONFIG_SOC_CPU_HAS_HWLOOP=y
# default:
CONFIG_SOC_CPU_HAS_HWLOOP_STATE_BUG=y
# default:
CONFIG_SOC_CPU_HAS_PIE=y
# default:
CONFIG_SOC_HP_CPU_HAS_MULTIPLE_CORES=y
# default:
CONFIG_SOC_CPU_BREAKPOINTS_NUM=3
# default:
CONFIG_SOC_CPU_WATCHPOINTS_NUM=3
# default:
CONFIG_SOC_CPU_WATCHPOINT_MAX_REGION_SIZE=0x100
# default:
CONFIG_SOC_CPU_HAS_PMA=y
# default:
CONFIG_SOC_CPU_IDRAM_SPLIT_USING_PMP=y
# default:
CONFIG_SOC_CPU_PMP_REGION_GRANULARITY=128
# default:
CONFIG_SOC_CPU_HAS_LOCKUP_RESET=y
# default:
CONFIG_SOC_CPU_HAS_ZC_EXTENSIONS=y
# default:
CONFIG_SOC_CPU_ZCMP_WORKAROUND=y
# default:
CONFIG_SOC_CPU_ZCMP_PUSH_REVERSED=y
# default:
CONFIG_SOC_CPU_ZCMP_POPRET_ISSUE=y
# default:
CONFIG_SOC_SIMD_PREFERRED_DATA_ALIGNMENT=16
# default:
CONFIG_SOC_DS_SIGNATURE_MAX_BIT_LEN=4096
# default:
CONFIG_SOC_DS_KEY_PARAM_MD_IV_LENGTH=16
# default:
CONFIG_SOC_DS_KEY_CHECK_MAX_WAIT_US=1100
# default:
CONFIG_SOC_DMA_CAN_ACCESS_FLASH=y
# default:
CONFIG_SOC_AHB_GDMA_VERSION=2
# default:
CONFIG_SOC_GDMA_SUPPORT_CRC=y
# default:
CONFIG_SOC_GDMA_SUPPORT_ETM=y
# default:
CONFIG_SOC_GDMA_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_GDMA_EXT_MEM_ENC_ALIGNMENT=16
# default:
CONFIG_SOC_GPIO_PORT=1
# default:
CONFIG_SOC_GPIO_PIN_COUNT=55
# default:
CONFIG_SOC_GPIO_SUPPORT_PIN_GLITCH_FILTER=y
# default:
CONFIG_SOC_GPIO_FLEX_GLITCH_FILTER_NUM=8
# default:
CONFIG_SOC_GPIO_SUPPORT_PIN_HYS_FILTER=y
# default:
CONFIG_SOC_GPIO_SUPPORT_ETM=y
# default:
CONFIG_SOC_GPIO_SUPPORT_HP_PERIPH_PD_SLEEP_WAKEUP=y
# default:
CONFIG_SOC_LP_IO_HAS_INDEPENDENT_WAKEUP_SOURCE=y
# default:
CONFIG_SOC_LP_IO_CLOCK_IS_INDEPENDENT=y
# default:
CONFIG_SOC_GPIO_VALID_GPIO_MASK=0x007FFFFFFFFFFFFF
# default:
CONFIG_SOC_GPIO_IN_RANGE_MAX=54
# default:
CONFIG_SOC_GPIO_OUT_RANGE_MAX=54
# default:
CONFIG_SOC_GPIO_HP_PERIPH_PD_SLEEP_WAKEABLE_MASK=0
# default:
CONFIG_SOC_GPIO_HP_PERIPH_PD_SLEEP_WAKEABLE_PIN_CNT=16
# default:
CONFIG_SOC_GPIO_VALID_DIGITAL_IO_PAD_MASK=0x007FFFFFFFFF0000
# default:
CONFIG_SOC_GPIO_SUPPORT_FORCE_HOLD=y
# default:
CONFIG_SOC_GPIO_SUPPORT_HOLD_SINGLE_IO_IN_DSLP=y
# default:
CONFIG_SOC_GPIO_CLOCKOUT_BY_GPIO_MATRIX=y
# default:
CONFIG_SOC_GPIO_CLOCKOUT_CHANNEL_NUM=2
# default:
CONFIG_SOC_CLOCKOUT_SUPPORT_CHANNEL_DIVIDER=y
# default:
CONFIG_SOC_DEBUG_PROBE_NUM_UNIT=1
# default:
CONFIG_SOC_DEBUG_PROBE_MAX_OUTPUT_WIDTH=16
# default:
CONFIG_SOC_RTCIO_PIN_COUNT=16
# default:
CONFIG_SOC_RTCIO_INPUT_OUTPUT_SUPPORTED=y
# default:
CONFIG_SOC_RTCIO_HOLD_SUPPORTED=y
# default:
CONFIG_SOC_RTCIO_WAKE_SUPPORTED=y
# default:
CONFIG_SOC_SDM_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_ETM_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_ANA_CMPR_NUM=2
# default:
CONFIG_SOC_ANA_CMPR_CAN_DISTINGUISH_EDGE=y
# default:
CONFIG_SOC_ANA_CMPR_SUPPORT_ETM=y
# default:
CONFIG_SOC_I2C_NUM=3
# default:
CONFIG_SOC_HP_I2C_NUM=2
# default:
CONFIG_SOC_LP_I2C_NUM=1
# default:
CONFIG_SOC_I2C_SUPPORT_XTAL=y
# default:
CONFIG_SOC_I2C_SUPPORT_RTC=y
# default:
CONFIG_SOC_I2C_SUPPORT_10BIT_ADDR=y
# default:
CONFIG_SOC_I2C_SUPPORT_SLAVE=y
# default:
CONFIG_SOC_I2C_SLAVE_SUPPORT_BROADCAST=y
# default:
CONFIG_SOC_I2C_SLAVE_CAN_GET_STRETCH_CAUSE=y
# default:
CONFIG_SOC_I2C_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_I2S_HW_VERSION_2=y
# default:
CONFIG_SOC_I2S_SUPPORTS_ETM=y
# default:
CONFIG_SOC_I2S_SUPPORTS_APLL=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PCM=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PDM=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PDM_TX=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PCM2PDM=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PDM_RX=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PDM2PCM=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PDM_RX_HP_FILTER=y
# default:
CONFIG_SOC_I2S_SUPPORTS_TX_SYNC_CNT=y
# default:
CONFIG_SOC_I2S_SUPPORTS_TDM=y
# default:
CONFIG_SOC_I2S_PDM_MAX_TX_LINES=2
# default:
CONFIG_SOC_I2S_PDM_MAX_RX_LINES=4
# default:
CONFIG_SOC_LP_I2S_NUM=1
# default:
CONFIG_SOC_ISP_BF_SUPPORTED=y
# default:
CONFIG_SOC_ISP_BLC_SUPPORTED=y
# default:
CONFIG_SOC_ISP_CCM_SUPPORTED=y
# default:
CONFIG_SOC_ISP_COLOR_SUPPORTED=y
# default:
CONFIG_SOC_ISP_CROP_SUPPORTED=y
# default:
CONFIG_SOC_ISP_DEMOSAIC_SUPPORTED=y
# default:
CONFIG_SOC_ISP_DVP_SUPPORTED=y
# default:
CONFIG_SOC_ISP_LSC_SUPPORTED=y
# default:
CONFIG_SOC_ISP_SHARPEN_SUPPORTED=y
# default:
CONFIG_SOC_ISP_WBG_SUPPORTED=y
# default:
CONFIG_SOC_ISP_SHARE_CSI_BRG=y
# default:
CONFIG_SOC_ISP_AE_BLOCK_X_NUMS=5
# default:
CONFIG_SOC_ISP_AE_BLOCK_Y_NUMS=5
# default:
CONFIG_SOC_ISP_AF_WINDOW_NUMS=3
# default:
CONFIG_SOC_ISP_AWB_WINDOW_X_NUMS=5
# default:
CONFIG_SOC_ISP_AWB_WINDOW_Y_NUMS=5
# default:
CONFIG_SOC_ISP_BF_TEMPLATE_X_NUMS=3
# default:
CONFIG_SOC_ISP_BF_TEMPLATE_Y_NUMS=3
# default:
CONFIG_SOC_ISP_CCM_DIMENSION=3
# default:
CONFIG_SOC_ISP_DEMOSAIC_GRAD_RATIO_INT_BITS=2
# default:
CONFIG_SOC_ISP_DEMOSAIC_GRAD_RATIO_DEC_BITS=4
# default:
CONFIG_SOC_ISP_DEMOSAIC_GRAD_RATIO_RES_BITS=26
# default:
CONFIG_SOC_ISP_SHARPEN_TEMPLATE_X_NUMS=3
# default:
CONFIG_SOC_ISP_SHARPEN_TEMPLATE_Y_NUMS=3
# default:
CONFIG_SOC_ISP_SHARPEN_H_FREQ_COEF_INT_BITS=3
# default:
CONFIG_SOC_ISP_SHARPEN_H_FREQ_COEF_DEC_BITS=5
# default:
CONFIG_SOC_ISP_SHARPEN_H_FREQ_COEF_RES_BITS=24
# default:
CONFIG_SOC_ISP_SHARPEN_M_FREQ_COEF_INT_BITS=3
# default:
CONFIG_SOC_ISP_SHARPEN_M_FREQ_COEF_DEC_BITS=5
# default:
CONFIG_SOC_ISP_SHARPEN_M_FREQ_COEF_RES_BITS=24
# default:
CONFIG_SOC_ISP_HIST_BLOCK_X_NUMS=5
# default:
CONFIG_SOC_ISP_HIST_BLOCK_Y_NUMS=5
# default:
CONFIG_SOC_ISP_HIST_SEGMENT_NUMS=16
# default:
CONFIG_SOC_ISP_HIST_INTERVAL_NUMS=15
# default:
CONFIG_SOC_ISP_LSC_GRAD_RATIO_INT_BITS=2
# default:
CONFIG_SOC_ISP_LSC_GRAD_RATIO_DEC_BITS=8
# default:
CONFIG_SOC_ISP_LSC_GRAD_RATIO_RES_BITS=22
# default:
CONFIG_SOC_LEDC_SUPPORT_PLL_DIV_CLOCK=y
# default:
CONFIG_SOC_LEDC_SUPPORT_XTAL_CLOCK=y
# default:
CONFIG_SOC_LEDC_TIMER_NUM=4
# default:
CONFIG_SOC_LEDC_CHANNEL_NUM=8
# default:
CONFIG_SOC_LEDC_TIMER_BIT_WIDTH=20
# default:
CONFIG_SOC_LEDC_GAMMA_CURVE_FADE_SUPPORTED=y
# default:
CONFIG_SOC_LEDC_GAMMA_CURVE_FADE_RANGE_MAX=16
# default:
CONFIG_SOC_LEDC_SUPPORT_FADE_STOP=y
# default:
CONFIG_SOC_LEDC_FADE_PARAMS_BIT_WIDTH=10
# default:
CONFIG_SOC_LEDC_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_LEDC_SUPPORT_ETM=y
# default:
CONFIG_SOC_MMU_PERIPH_NUM=2
# default:
CONFIG_SOC_MMU_LINEAR_ADDRESS_REGION_NUM=2
# default:
CONFIG_SOC_MMU_DI_VADDR_SHARED=y
# default:
CONFIG_SOC_MMU_PER_EXT_MEM_TARGET=y
# default:
CONFIG_SOC_MPU_MIN_REGION_SIZE=0x20000000
# default:
CONFIG_SOC_MPU_REGIONS_MAX_NUM=8
# default:
CONFIG_SOC_PCNT_SUPPORT_RUNTIME_THRES_UPDATE=y
# default:
CONFIG_SOC_PCNT_SUPPORT_CLEAR_SIGNAL=y
# default:
CONFIG_SOC_RMT_MEM_WORDS_PER_CHANNEL=48
# default:
CONFIG_SOC_RMT_SUPPORT_RX_PINGPONG=y
# default:
CONFIG_SOC_RMT_SUPPORT_TX_LOOP_COUNT=y
# default:
CONFIG_SOC_RMT_SUPPORT_TX_LOOP_AUTO_STOP=y
# default:
CONFIG_SOC_RMT_SUPPORT_DMA=y
# default:
CONFIG_SOC_RMT_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_MCPWM_SWSYNC_CAN_PROPAGATE=y
# default:
CONFIG_SOC_MCPWM_SUPPORT_ETM=y
# default:
CONFIG_SOC_MCPWM_SUPPORT_EVENT_COMPARATOR=y
# default:
CONFIG_SOC_MCPWM_CAPTURE_CLK_FROM_GROUP=y
# default:
CONFIG_SOC_MCPWM_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_USB_OTG_PERIPH_NUM=2
# default:
CONFIG_SOC_USB_UTMI_PHY_NUM=1
# default:
CONFIG_SOC_USB_UTMI_PHY_NO_POWER_OFF_ISO=y
# default:
CONFIG_SOC_PARLIO_TX_UNIT_MAX_DATA_WIDTH=16
# default:
CONFIG_SOC_PARLIO_RX_UNIT_MAX_DATA_WIDTH=16
# default:
CONFIG_SOC_PARLIO_TX_CLK_SUPPORT_GATING=y
# default:
CONFIG_SOC_PARLIO_RX_CLK_SUPPORT_GATING=y
# default:
CONFIG_SOC_PARLIO_TX_SUPPORT_LOOP_TRANSMISSION=y
# default:
CONFIG_SOC_PARLIO_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_PARLIO_SUPPORT_I80_LCD=y
# default:
CONFIG_SOC_MPI_MEM_BLOCKS_NUM=4
# default:
CONFIG_SOC_MPI_OPERATIONS_NUM=3
# default:
CONFIG_SOC_RSA_MAX_BIT_LEN=4096
# default:
CONFIG_SOC_SDMMC_USE_IOMUX=y
# default:
CONFIG_SOC_SDMMC_USE_GPIO_MATRIX=y
# default:
CONFIG_SOC_SDMMC_NUM_SLOTS=2
# default:
CONFIG_SOC_SDMMC_DATA_WIDTH_MAX=8
# default:
CONFIG_SOC_SDMMC_DELAY_PHASE_NUM=8
# default:
CONFIG_SOC_SDMMC_IO_POWER_EXTERNAL=y
# default:
CONFIG_SOC_SDMMC_PSRAM_DMA_CAPABLE=y
# default:
CONFIG_SOC_SDMMC_UHS_I_SUPPORTED=y
# default:
CONFIG_SOC_SHA_DMA_MAX_BUFFER_SIZE=3968
# default:
CONFIG_SOC_SHA_SUPPORT_DMA=y
# default:
CONFIG_SOC_SHA_SUPPORT_RESUME=y
# default:
CONFIG_SOC_SHA_GDMA=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA1=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA224=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA256=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA384=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA512=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA512_224=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA512_256=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA512_T=y
# default:
CONFIG_SOC_ECC_CONSTANT_TIME_POINT_MUL=y
# default:
CONFIG_SOC_ECC_SUPPORT_CURVE_P384=y
# default:
CONFIG_SOC_ECDSA_SUPPORT_EXPORT_PUBKEY=y
# default:
CONFIG_SOC_ECDSA_SUPPORT_DETERMINISTIC_MODE=y
# default:
CONFIG_SOC_ECDSA_SUPPORT_HW_DETERMINISTIC_LOOP=y
# default:
CONFIG_SOC_ECDSA_USES_MPI=y
# default:
CONFIG_SOC_ECDSA_SUPPORT_CURVE_P384=y
# default:
CONFIG_SOC_ECDSA_SUPPORT_CURVE_SPECIFIC_KEY_PURPOSES=y
# default:
CONFIG_SOC_SPI_PERIPH_NUM=3
# default:
CONFIG_SOC_SPI_MAX_CS_NUM=6
# default:
CONFIG_SOC_SPI_MAXIMUM_BUFFER_SIZE=64
# default:
CONFIG_SOC_SPI_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_SPI_SUPPORT_SLAVE_HD_VER2=y
# default:
CONFIG_SOC_SPI_SLAVE_SUPPORT_SEG_TRANS=y
# default:
CONFIG_SOC_SPI_SUPPORT_DDRCLK=y
# default:
CONFIG_SOC_SPI_SUPPORT_CD_SIG=y
# default:
CONFIG_SOC_SPI_SUPPORT_OCT=y
# default:
CONFIG_SOC_SPI_SUPPORT_CLK_XTAL=y
# default:
CONFIG_SOC_SPI_SUPPORT_CLK_RC_FAST=y
# default:
CONFIG_SOC_MSPI_HAS_INDEPENT_IOMUX=y
# default:
CONFIG_SOC_MEMSPI_IS_INDEPENDENT=y
# default:
CONFIG_SOC_SPI_MAX_PRE_DIVIDER=16
# default:
CONFIG_SOC_LP_SPI_MAXIMUM_BUFFER_SIZE=64
# default:
CONFIG_SOC_SPIRAM_XIP_SUPPORTED=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_AUTO_WAIT_IDLE=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_AUTO_SUSPEND=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_AUTO_RESUME=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_IDLE_INTR=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_SW_SUSPEND=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_CHECK_SUS=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_TIMING_TUNING=y
# default:
CONFIG_SOC_MEMSPI_TIMING_TUNING_BY_DQS=y
# default:
CONFIG_SOC_MEMSPI_TIMING_TUNING_BY_FLASH_DELAY=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_CACHE_32BIT_ADDR_MAP=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_TSUS_TRES_SEPERATE_CTR=y
# default:
CONFIG_SOC_SPI_PERIPH_SUPPORT_CONTROL_DUMMY_OUT=y
# default:
CONFIG_SOC_SPI_MEM_FLASH_SUPPORT_HPM=y
# default:
CONFIG_SOC_MEMSPI_ENCRYPTION_ALIGNMENT=16
# default:
CONFIG_SOC_SYSTIMER_COUNTER_NUM=2
# default:
CONFIG_SOC_SYSTIMER_ALARM_NUM=3
# default:
CONFIG_SOC_SYSTIMER_BIT_WIDTH_LO=32
# default:
CONFIG_SOC_SYSTIMER_BIT_WIDTH_HI=20
# default:
CONFIG_SOC_SYSTIMER_FIXED_DIVIDER=y
# default:
CONFIG_SOC_SYSTIMER_SUPPORT_RC_FAST=y
# default:
CONFIG_SOC_SYSTIMER_INT_LEVEL=y
# default:
CONFIG_SOC_SYSTIMER_ALARM_MISS_COMPENSATE=y
# default:
CONFIG_SOC_SYSTIMER_SUPPORT_ETM=y
# default:
CONFIG_SOC_LP_TIMER_BIT_WIDTH_LO=32
# default:
CONFIG_SOC_LP_TIMER_BIT_WIDTH_HI=16
# default:
CONFIG_SOC_TIMER_SUPPORT_ETM=y
# default:
CONFIG_SOC_TIMER_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_MWDT_SUPPORT_XTAL=y
# default:
CONFIG_SOC_MWDT_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_TOUCH_SENSOR_VERSION=3
# default:
CONFIG_SOC_TOUCH_MIN_CHAN_ID=1
# default:
CONFIG_SOC_TOUCH_MAX_CHAN_ID=14
# default:
CONFIG_SOC_TOUCH_SUPPORT_SLEEP_WAKEUP=y
# default:
CONFIG_SOC_TOUCH_SUPPORT_BENCHMARK=y
# default:
CONFIG_SOC_TOUCH_SUPPORT_WATERPROOF=y
# default:
CONFIG_SOC_TOUCH_SUPPORT_PROX_SENSING=y
# default:
CONFIG_SOC_TOUCH_PROXIMITY_CHANNEL_NUM=3
# default:
CONFIG_SOC_TOUCH_SAMPLE_CFG_NUM=3
# default:
CONFIG_SOC_TWAI_CONTROLLER_NUM=3
# default:
CONFIG_SOC_TWAI_MASK_FILTER_NUM=1
# default:
CONFIG_SOC_TWAI_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_EFUSE_DIS_PAD_JTAG=y
# default:
CONFIG_SOC_EFUSE_DIS_USB_JTAG=y
