ctag-fh-kiel/ctag-tbd/sdkconfig.defaults
# default:
CONFIG_SOC_EFUSE_DIS_DIRECT_BOOT=y
# default:
CONFIG_SOC_EFUSE_SOFT_DIS_JTAG=y
# default:
CONFIG_SOC_EFUSE_DIS_DOWNLOAD_MSPI=y
# default:
CONFIG_SOC_EFUSE_ECDSA_KEY=y
# default:
CONFIG_SOC_EFUSE_XTS_AES_KEY_128=y
# default:
CONFIG_SOC_EFUSE_XTS_AES_KEY_256=y
# default:
CONFIG_SOC_EFUSE_ECDSA_KEY_P192=y
# default:
CONFIG_SOC_EFUSE_ECDSA_KEY_P384=y
# default:
CONFIG_SOC_KEY_MANAGER_SUPPORT_KEY_DEPLOYMENT=y
# default:
CONFIG_SOC_KEY_MANAGER_ECDSA_KEY_DEPLOY=y
# default:
CONFIG_SOC_KEY_MANAGER_FE_KEY_DEPLOY=y
# default:
CONFIG_SOC_KEY_MANAGER_FE_KEY_DEPLOY_XTS_AES_128=y
# default:
CONFIG_SOC_KEY_MANAGER_FE_KEY_DEPLOY_XTS_AES_256=y
# default:
CONFIG_SOC_KEY_MANAGER_HMAC_KEY_DEPLOY=y
# default:
CONFIG_SOC_KEY_MANAGER_DS_KEY_DEPLOY=y
# default:
CONFIG_SOC_SECURE_BOOT_V2_RSA=y
# default:
CONFIG_SOC_SECURE_BOOT_V2_ECC=y
# default:
CONFIG_SOC_EFUSE_SECURE_BOOT_KEY_DIGESTS=3
# default:
CONFIG_SOC_EFUSE_REVOKE_BOOT_KEY_DIGESTS=y
# default:
CONFIG_SOC_SUPPORT_SECURE_BOOT_REVOKE_KEY=y
# default:
CONFIG_SOC_FLASH_ENCRYPTED_XTS_AES_BLOCK_MAX=64
# default:
CONFIG_SOC_FLASH_ENCRYPTION_XTS_AES=y
# default:
CONFIG_SOC_FLASH_ENCRYPTION_XTS_AES_OPTIONS=y
# default:
CONFIG_SOC_FLASH_ENCRYPTION_XTS_AES_128=y
# default:
CONFIG_SOC_FLASH_ENCRYPTION_XTS_AES_256=y
# default:
CONFIG_SOC_FLASH_ENCRYPTION_XTS_AES_SUPPORT_PSEUDO_ROUND=y
# default:
CONFIG_SOC_FLASH_ENCRYPTION_PAGE_CONFIGURABLE=y
# default:
CONFIG_SOC_PSRAM_ENCRYPTION_SEPARATE_KEY=y
# default:
CONFIG_SOC_PSRAM_ENCRYPTION_PAGE_CONFIGURABLE=y
# default:
CONFIG_SOC_UART_NUM=6
# default:
CONFIG_SOC_UART_HP_NUM=5
# default:
CONFIG_SOC_UART_LP_NUM=1
# default:
CONFIG_SOC_UART_FIFO_LEN=128
# default:
CONFIG_SOC_LP_UART_FIFO_LEN=16
# default:
CONFIG_SOC_UART_BITRATE_MAX=5000000
# default:
CONFIG_SOC_UART_SUPPORT_RTC_CLK=y
# default:
CONFIG_SOC_UART_SUPPORT_XTAL_CLK=y
# default:
CONFIG_SOC_UART_SUPPORT_WAKEUP_INT=y
# default:
CONFIG_SOC_UART_HAS_LP_UART=y
# default:
CONFIG_SOC_UART_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_UART_WAKEUP_CHARS_SEQ_MAX_LEN=5
# default:
CONFIG_SOC_UART_WAKEUP_SUPPORT_ACTIVE_THRESH_MODE=y
# default:
CONFIG_SOC_UART_WAKEUP_SUPPORT_FIFO_THRESH_MODE=y
# default:
CONFIG_SOC_UART_WAKEUP_SUPPORT_START_BIT_MODE=y
# default:
CONFIG_SOC_UART_WAKEUP_SUPPORT_CHAR_SEQ_MODE=y
# default:
CONFIG_SOC_LP_I2S_SUPPORT_VAD=y
# default:
CONFIG_SOC_UHCI_NUM=1
# default:
CONFIG_SOC_COEX_HW_PTI=y
# default:
CONFIG_SOC_PHY_DIG_REGS_MEM_SIZE=21
# default:
CONFIG_SOC_WIFI_LIGHT_SLEEP_CLK_WIDTH=12
# default:
CONFIG_SOC_PM_SUPPORT_EXT1_WAKEUP=y
# default:
CONFIG_SOC_PM_SUPPORT_EXT1_WAKEUP_MODE_PER_PIN=y
# default:
CONFIG_SOC_PM_EXT1_WAKEUP_BY_PMU=y
# default:
CONFIG_SOC_PM_SUPPORT_WIFI_WAKEUP=y
# default:
CONFIG_SOC_PM_SUPPORT_TOUCH_SENSOR_WAKEUP=y
# default:
CONFIG_SOC_PM_SUPPORT_LP_UART_WAKEUP=y
# default:
CONFIG_SOC_PM_SUPPORT_CPU_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_XTAL32K_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_RC32K_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_RC_FAST_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_VDDSDIO_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_TOP_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_CNNT_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_RTC_PERIPH_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_DEEPSLEEP_CHECK_STUB_ONLY=y
# default:
CONFIG_SOC_PM_CPU_RETENTION_BY_SW=y
# default:
CONFIG_SOC_PM_FPU_RETENTION_BY_SW=y
# default:
CONFIG_SOC_PM_CACHE_RETENTION_BY_PAU=y
# default:
CONFIG_SOC_PM_PAU_LINK_NUM=4
# default:
CONFIG_SOC_PM_PAU_REGDMA_LINK_MULTI_ADDR=y
# default:
CONFIG_SOC_PAU_IN_TOP_DOMAIN=y
# default:
CONFIG_SOC_PM_PAU_REGDMA_UPDATE_CACHE_BEFORE_WAIT_COMPARE=y
# default:
CONFIG_SOC_SLEEP_SYSTIMER_STALL_WORKAROUND=y
# default:
CONFIG_SOC_SLEEP_TGWDT_STOP_WORKAROUND=y
# default:
CONFIG_SOC_PM_RETENTION_MODULE_NUM=64
# default:
CONFIG_SOC_CLK_RC_FAST_SUPPORT_CALIBRATION=y
# default:
CONFIG_SOC_CLK_APLL_SUPPORTED=y
# default:
CONFIG_SOC_CLK_MPLL_SUPPORTED=y
# default:
CONFIG_SOC_CLK_XTAL32K_SUPPORTED=y
# default:
CONFIG_SOC_CLK_RC32K_SUPPORTED=y
# default:
CONFIG_SOC_CLK_LP_FAST_SUPPORT_LP_PLL=y
# default:
CONFIG_SOC_CLK_LP_FAST_SUPPORT_XTAL=y
# default:
CONFIG_SOC_PERIPH_CLK_CTRL_SHARED=y
# default:
CONFIG_SOC_TEMPERATURE_SENSOR_INTR_SUPPORT=y
# default:
CONFIG_SOC_TSENS_IS_INDEPENDENT_FROM_ADC=y
# default:
CONFIG_SOC_TEMPERATURE_SENSOR_SUPPORT_ETM=y
# default:
CONFIG_SOC_TEMPERATURE_SENSOR_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_MEM_SPM_SUPPORTED=y
# default:
CONFIG_SOC_ASYNCHRONOUS_BUS_ERROR_MODE=y
# default:
CONFIG_SOC_EMAC_IEEE1588V2_SUPPORTED=y
# default:
CONFIG_SOC_EMAC_USE_MULTI_IO_MUX=y
# default:
CONFIG_SOC_EMAC_MII_USE_GPIO_MATRIX=y
# default:
CONFIG_SOC_EMAC_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_JPEG_CODEC_SUPPORTED=y
# default:
CONFIG_SOC_JPEG_DECODE_SUPPORTED=y
# default:
CONFIG_SOC_JPEG_ENCODE_SUPPORTED=y
# default:
CONFIG_SOC_LCDCAM_CAM_SUPPORT_RGB_YUV_CONV=y
# default:
CONFIG_SOC_LCDCAM_LCD_SUPPORT_SLEEP_RETENTION=y
# default:
CONFIG_SOC_I3C_MASTER_PERIPH_NUM=y
# default:
CONFIG_SOC_I3C_MASTER_ADDRESS_TABLE_NUM=12
# default:
CONFIG_SOC_I3C_MASTER_COMMAND_TABLE_NUM=12
# default:
CONFIG_SOC_LP_CORE_SUPPORT_ETM=y
# default:
CONFIG_SOC_LP_CORE_SUPPORT_LP_ADC=y
# default:
CONFIG_SOC_LP_CORE_SUPPORT_STORE_LOAD_EXCEPTIONS=y
# default:
CONFIG_IDF_CMAKE=y
# default:
CONFIG_IDF_TOOLCHAIN="gcc"
# default:
CONFIG_IDF_TOOLCHAIN_GCC=y
# default:
CONFIG_IDF_TARGET_ARCH_RISCV=y
# default:
CONFIG_IDF_TARGET_ARCH="riscv"
# default:
CONFIG_IDF_TARGET="esp32p4"
# default:
CONFIG_IDF_INIT_VERSION="6.0.1"
# default:
CONFIG_IDF_TARGET_ESP32P4=y
# default:
CONFIG_IDF_FIRMWARE_CHIP_ID=0x0012

#
# Build type
#
CONFIG_APP_BUILD_TYPE_APP_2NDBOOT=y
# CONFIG_APP_BUILD_TYPE_RAM is not set
# default:
CONFIG_APP_BUILD_GENERATE_BINARIES=y
# default:
CONFIG_APP_BUILD_BOOTLOADER=y
# default:
CONFIG_APP_BUILD_USE_FLASH_SECTIONS=y
# CONFIG_APP_REPRODUCIBLE_BUILD is not set
# CONFIG_APP_NO_BLOBS is not set
# end of Build type

#
# App Update config
#
# end of App Update config

#
# Bootloader config
#

#
# Bootloader manager
#
CONFIG_BOOTLOADER_COMPILE_TIME_DATE=y
CONFIG_BOOTLOADER_PROJECT_VER=1
# end of Bootloader manager

#
# Application Rollback
#
# CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE is not set
# end of Application Rollback

#
# Recovery Bootloader and Rollback
#
# end of Recovery Bootloader and Rollback

# default:
CONFIG_BOOTLOADER_OFFSET_IN_FLASH=0x2000
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
# CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_DEBUG is not set
# CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF is not set

#
# Log
#
CONFIG_BOOTLOADER_LOG_VERSION_1=y
# default:
CONFIG_BOOTLOADER_LOG_VERSION=1
# CONFIG_BOOTLOADER_LOG_LEVEL_NONE is not set
# CONFIG_BOOTLOADER_LOG_LEVEL_ERROR is not set
# CONFIG_BOOTLOADER_LOG_LEVEL_WARN is not set
CONFIG_BOOTLOADER_LOG_LEVEL_INFO=y
# CONFIG_BOOTLOADER_LOG_LEVEL_DEBUG is not set
# CONFIG_BOOTLOADER_LOG_LEVEL_VERBOSE is not set
# default:
CONFIG_BOOTLOADER_LOG_LEVEL=3

#
# Format
#
# CONFIG_BOOTLOADER_LOG_COLORS is not set
CONFIG_BOOTLOADER_LOG_TIMESTAMP_SOURCE_CPU_TICKS=y
# end of Format

#
# Settings
#
# default:
CONFIG_BOOTLOADER_LOG_MODE_TEXT_EN=y
CONFIG_BOOTLOADER_LOG_MODE_TEXT=y
# end of Settings
# end of Log

# default:
CONFIG_BOOTLOADER_CPU_CLK_FREQ_MHZ=100

#
# Serial Flash Configurations
#
# CONFIG_BOOTLOADER_FLASH_DC_AWARE is not set
CONFIG_BOOTLOADER_FLASH_XMC_SUPPORT=y
# end of Serial Flash Configurations

