ctag-fh-kiel/ctag-tbd/sdkconfig.defaults
CONFIG_VFS_INITIALIZE_DEV_NULL=y
# end of Virtual file system

#
# Wear Levelling
#
# CONFIG_WL_SECTOR_SIZE_512 is not set
CONFIG_WL_SECTOR_SIZE_4096=y
# default:
CONFIG_WL_SECTOR_SIZE=4096
# end of Wear Levelling

#
# ESP-ASIO
#
# default:
CONFIG_ASIO_IS_ENABLED=y
# CONFIG_ASIO_SSL_SUPPORT is not set
# end of ESP-ASIO

#
# eppp_link
#
# CONFIG_EPPP_LINK_USES_PPP is not set
CONFIG_EPPP_LINK_DEVICE_UART=y
# CONFIG_EPPP_LINK_DEVICE_SPI is not set
# CONFIG_EPPP_LINK_DEVICE_SDIO is not set
# CONFIG_EPPP_LINK_DEVICE_ETH is not set
CONFIG_EPPP_LINK_CONN_MAX_RETRY=6
# CONFIG_EPPP_LINK_CHANNELS_SUPPORT is not set
# end of eppp_link

#
# DSP Library
#
# default:
CONFIG_DSP_OPTIMIZATIONS_SUPPORTED=y
# CONFIG_DSP_ANSI is not set
CONFIG_DSP_OPTIMIZED=y
# default:
CONFIG_DSP_OPTIMIZATION=1
# CONFIG_DSP_MAX_FFT_SIZE_512 is not set
# CONFIG_DSP_MAX_FFT_SIZE_1024 is not set
# CONFIG_DSP_MAX_FFT_SIZE_2048 is not set
CONFIG_DSP_MAX_FFT_SIZE_4096=y
# CONFIG_DSP_MAX_FFT_SIZE_8192 is not set
# CONFIG_DSP_MAX_FFT_SIZE_16384 is not set
# CONFIG_DSP_MAX_FFT_SIZE_32768 is not set
# default:
CONFIG_DSP_MAX_FFT_SIZE=4096
# end of DSP Library

CONFIG_ESP_HOSTED_ENABLED=y

#
# ESP-Hosted config
#
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
# CONFIG_ESP_HOSTED_CP_TARGET_ESP32H2 is not set
# CONFIG_ESP_HOSTED_CP_TARGET_ESP32H4 is not set
# default:
CONFIG_ESP_HOSTED_PRIV_ENABLE_WIFI_OPTIONS=y

#
# ESP32-C6 is Co-processor Target from Wi-Fi Remote Component
#
# default:
CONFIG_ESP_HOSTED_IDF_SLAVE_TARGET="esp32c6"
CONFIG_ESP_HOSTED_P4_DEV_BOARD_NONE=y
# CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD is not set
# CONFIG_ESP32P4_EYE_C6_BOARD is not set
# CONFIG_ESP_HOSTED_P4_C6_CORE_BOARD is not set
# default:
CONFIG_ESP_HOSTED_PRIV_SDIO_OPTION=y
# default:
CONFIG_ESP_HOSTED_PRIV_SPI_HD_OPTION=y
# CONFIG_ESP_HOSTED_SPI_HOST_INTERFACE is not set
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
# CONFIG_ESP_HOSTED_SPI_HD_HOST_INTERFACE is not set
# CONFIG_ESP_HOSTED_UART_HOST_INTERFACE is not set

#
# Hosted SDIO Configuration
#
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
# CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_LOW is not set
# CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_NONE is not set
# CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_MAX_SIZE is not set
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y
# CONFIG_ESP_HOSTED_SDIO_SLOT_0 is not set
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
# default:
CONFIG_ESP_HOSTED_SDIO_SLOT=1
# CONFIG_ESP_HOSTED_SD_PWR_CTRL_LDO_INTERNAL_IO is not set
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
# CONFIG_ESP_HOSTED_SDIO_1_BIT_BUS is not set
# default:
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=4
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
# default:
CONFIG_ESP_HOSTED_SDIO_CMD_GPIO_RANGE_MIN=0
# default:
CONFIG_ESP_HOSTED_SDIO_CMD_GPIO_RANGE_MAX=100
# default:
CONFIG_ESP_HOSTED_SDIO_CLK_GPIO_RANGE_MIN=0
# default:
CONFIG_ESP_HOSTED_SDIO_CLK_GPIO_RANGE_MAX=100
# default:
CONFIG_ESP_HOSTED_SDIO_D0_GPIO_RANGE_MIN=0
# default:
CONFIG_ESP_HOSTED_SDIO_D0_GPIO_RANGE_MAX=100
# default:
CONFIG_ESP_HOSTED_SDIO_D1_GPIO_RANGE_MIN=0
# default:
CONFIG_ESP_HOSTED_SDIO_D1_GPIO_RANGE_MAX=100
# default:
CONFIG_ESP_HOSTED_SDIO_D2_GPIO_RANGE_MIN=0
# default:
CONFIG_ESP_HOSTED_SDIO_D2_GPIO_RANGE_MAX=100
# default:
CONFIG_ESP_HOSTED_SDIO_D3_GPIO_RANGE_MIN=0
# default:
CONFIG_ESP_HOSTED_SDIO_D3_GPIO_RANGE_MAX=100
# default:
CONFIG_ESP_HOSTED_SDIO_RESET_SLAVE_GPIO_MIN=0
# default:
CONFIG_ESP_HOSTED_SDIO_RESET_SLAVE_GPIO_MAX=100
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CMD_SLOT_1=19
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1=18
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D0_SLOT_1=14
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D1_4BIT_BUS_SLOT_1=15
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D2_4BIT_BUS_SLOT_1=16
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D3_4BIT_BUS_SLOT_1=17
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=54
# default:
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=19
# default:
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=18
# default:
CONFIG_ESP_HOSTED_SDIO_PIN_D0=14
# default:
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=15
# default:
CONFIG_ESP_HOSTED_SDIO_PIN_D2=16
# default:
CONFIG_ESP_HOSTED_SDIO_PIN_D3=17
# default:
CONFIG_ESP_HOSTED_SDIO_PIN_D1=15
CONFIG_ESP_HOSTED_SDIO_TX_Q_SIZE=20
CONFIG_ESP_HOSTED_SDIO_RX_Q_SIZE=20
CONFIG_ESP_HOSTED_SDIO_RESET_DELAY_MS=1500
# CONFIG_ESP_HOSTED_SDIO_CHECKSUM is not set
# end of Hosted SDIO Configuration

#
# Common Slave Reset Strategy
#
CONFIG_ESP_HOSTED_SLAVE_RESET_ON_EVERY_HOST_BOOTUP=y
# CONFIG_ESP_HOSTED_SLAVE_RESET_ONLY_IF_NECESSARY is not set
# end of Common Slave Reset Strategy

# default:
CONFIG_ESP_HOSTED_GPIO_SLAVE_RESET_SLAVE=54

#
# Bluetooth Support
#

#
# Following options must be set before this option can be enabled
#

#
# 'Component config->Bluetooth' must be enabled
#
# end of Bluetooth Support

#
# Task defaults
#
CONFIG_ESP_HOSTED_RPC_TASK_STACK=4096
CONFIG_ESP_HOSTED_DFLT_TASK_STACK=3072
CONFIG_ESP_HOSTED_DFLT_TASK_FROM_SPIRAM=y
# end of Task defaults

CONFIG_ESP_HOSTED_TRANSPORT_RESTART_ON_FAILURE=y
CONFIG_ESP_HOSTED_MEM_MONITOR=y
CONFIG_ESP_HOSTED_ENABLE_ITWT=y
# CONFIG_ESP_HOSTED_WIFI_AUTO_CONNECT_ON_STA_START is not set
# CONFIG_ESP_HOSTED_ENABLE_GPIO_EXPANDER is not set
# CONFIG_ESP_HOSTED_CP_EXT_COEX is not set
# CONFIG_ESP_HOSTED_ENABLE_DPP is not set
# CONFIG_ESP_HOSTED_USE_MEMPOOL is not set
CONFIG_ESP_HOSTED_MAX_SIMULTANEOUS_SYNC_RPC_REQUESTS=5
CONFIG_ESP_HOSTED_MAX_SIMULTANEOUS_ASYNC_RPC_REQUESTS=5
CONFIG_ESP_HOSTED_CLI_ENABLED=y
# CONFIG_ESP_HOSTED_CLI_NEW_INSTANCE is not set

#
# Debug Settings
#
# CONFIG_ESP_HOSTED_FW_VERSION_MISMATCH_WARNING_SUPPRESS is not set
# CONFIG_ESP_HOSTED_RAW_THROUGHPUT_TRANSPORT is not set
# CONFIG_ESP_HOSTED_PKT_STATS is not set
# end of Debug Settings

#
# Data path options
#
CONFIG_ESP_HOSTED_HOST_TO_ESP_WIFI_DATA_THROTTLE=y
CONFIG_ESP_HOSTED_PRIV_WIFI_TX_SDIO_HIGH_THRESHOLD=80
# default:
CONFIG_ESP_HOSTED_TO_WIFI_DATA_THROTTLE_HIGH_THRESHOLD=80
CONFIG_ESP_HOSTED_TO_WIFI_DATA_THROTTLE_LOW_THRESHOLD=60
# end of Data path options

CONFIG_ESP_HOSTED_ENABLE_PEER_DATA_TRANSFER=y
CONFIG_ESP_HOSTED_MAX_CUSTOM_MSG_HANDLERS=3
# CONFIG_ESP_HOSTED_DECODE_WIFI_RESERVED_FIELD is not set
# CONFIG_ESP_HOSTED_NETWORK_SPLIT_ENABLED is not set
# CONFIG_ESP_HOSTED_HOST_POWER_SAVE_ENABLED is not set
# end of ESP-Hosted config

#
# TinyUSB Stack
#
CONFIG_TINYUSB_DEBUG_LEVEL=0

#
# TinyUSB DCD
#
# CONFIG_TINYUSB_MODE_SLAVE is not set
CONFIG_TINYUSB_MODE_DMA=y
# end of TinyUSB DCD

#
# TinyUSB callbacks
#
# CONFIG_TINYUSB_SUSPEND_CALLBACK is not set
# CONFIG_TINYUSB_RESUME_CALLBACK is not set
# end of TinyUSB callbacks

#
# Descriptor configuration
#

#
# You can provide your custom descriptors via tinyusb_driver_install()
#
CONFIG_TINYUSB_DESC_USE_ESPRESSIF_VID=y
CONFIG_TINYUSB_DESC_USE_DEFAULT_PID=y
CONFIG_TINYUSB_DESC_BCD_DEVICE=0x0100
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="Espressif Systems"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="Espressif Device"
CONFIG_TINYUSB_DESC_SERIAL_STRING="123456"
# end of Descriptor configuration

#
# Mass Storage Class (MSC)
#
# CONFIG_TINYUSB_MSC_ENABLED is not set
# end of Mass Storage Class (MSC)

#
# Communication Device Class (CDC)
#
# CONFIG_TINYUSB_CDC_ENABLED is not set
# end of Communication Device Class (CDC)

#
# Musical Instrument Digital Interface (MIDI)
#
CONFIG_TINYUSB_MIDI_COUNT=1
# end of Musical Instrument Digital Interface (MIDI)

#
# Human Interface Device Class (HID)
#
CONFIG_TINYUSB_HID_COUNT=0
# end of Human Interface Device Class (HID)

#
# Device Firmware Upgrade (DFU)
#
# CONFIG_TINYUSB_DFU_MODE_DFU is not set
# CONFIG_TINYUSB_DFU_MODE_DFU_RUNTIME is not set
CONFIG_TINYUSB_DFU_MODE_NONE=y
# end of Device Firmware Upgrade (DFU)

#
# Bluetooth Host Class (BTH)
#
# CONFIG_TINYUSB_BTH_ENABLED is not set
# end of Bluetooth Host Class (BTH)

#
# Network driver (ECM/NCM/RNDIS)
#
# CONFIG_TINYUSB_NET_MODE_ECM_RNDIS is not set
CONFIG_TINYUSB_NET_MODE_NCM=y
# CONFIG_TINYUSB_NET_MODE_NONE is not set
CONFIG_TINYUSB_NCM_OUT_NTB_BUFFS_COUNT=3
CONFIG_TINYUSB_NCM_IN_NTB_BUFFS_COUNT=3
CONFIG_TINYUSB_NCM_OUT_NTB_BUFF_MAX_SIZE=3200
CONFIG_TINYUSB_NCM_IN_NTB_BUFF_MAX_SIZE=3200
# end of Network driver (ECM/NCM/RNDIS)

#
# Vendor Specific Interface
#
CONFIG_TINYUSB_VENDOR_COUNT=0
# end of Vendor Specific Interface
# end of TinyUSB Stack

#
# Wi-Fi Remote
#
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
# default:
CONFIG_ESP_WIFI_REMOTE_IDF_SPECIFIC_ADDED=y
# CONFIG_SLAVE_IDF_TARGET_ESP32 is not set
# CONFIG_SLAVE_IDF_TARGET_ESP32S2 is not set
# CONFIG_SLAVE_IDF_TARGET_ESP32C3 is not set
# CONFIG_SLAVE_IDF_TARGET_ESP32S3 is not set
# CONFIG_SLAVE_IDF_TARGET_ESP32C2 is not set
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
# CONFIG_SLAVE_IDF_TARGET_ESP32C5 is not set
# CONFIG_SLAVE_IDF_TARGET_ESP32C61 is not set
# default:
CONFIG_SLAVE_SOC_WIFI_SUPPORTED=y
# default:
CONFIG_SLAVE_SOC_WIFI_WAPI_SUPPORT=y
# default:
CONFIG_SLAVE_SOC_WIFI_CSI_SUPPORT=y
# default:
CONFIG_SLAVE_SOC_WIFI_MESH_SUPPORT=y
# default:
CONFIG_SLAVE_SOC_WIFI_LIGHT_SLEEP_CLK_WIDTH=12
# default:
CONFIG_SLAVE_SOC_WIFI_HW_TSF=y
# default:
CONFIG_SLAVE_SOC_WIFI_FTM_SUPPORT=y
# default:
CONFIG_SLAVE_FREERTOS_UNICORE=y
# default:
CONFIG_SLAVE_SOC_WIFI_GCMP_SUPPORT=y
# default:
CONFIG_SLAVE_SOC_WIFI_TXOP_SUPPORT=y
# default:
CONFIG_SLAVE_IDF_TARGET_ARCH_RISCV=y
# default:
CONFIG_SLAVE_SOC_WIFI_HE_SUPPORT=y
# default:
CONFIG_SLAVE_SOC_WIFI_MAC_VERSION_NUM=2

#
# Wi-Fi configuration
#
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=10
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=32
# CONFIG_WIFI_RMT_STATIC_TX_BUFFER is not set
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER=y
# default:
CONFIG_WIFI_RMT_TX_BUFFER_TYPE=1
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_WIFI_RMT_STATIC_RX_MGMT_BUFFER=y
# CONFIG_WIFI_RMT_DYNAMIC_RX_MGMT_BUFFER is not set
# default:
CONFIG_WIFI_RMT_DYNAMIC_RX_MGMT_BUF=0
CONFIG_WIFI_RMT_RX_MGMT_BUF_NUM_DEF=5
# CONFIG_WIFI_RMT_CSI_ENABLED is not set
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
CONFIG_WIFI_RMT_TX_BA_WIN=6
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
CONFIG_WIFI_RMT_RX_BA_WIN=6
CONFIG_WIFI_RMT_NVS_ENABLED=y
CONFIG_WIFI_RMT_SOFTAP_BEACON_MAX_LEN=752
CONFIG_WIFI_RMT_MGMT_SBUF_NUM=32
CONFIG_WIFI_RMT_IRAM_OPT=y
# CONFIG_WIFI_RMT_EXTRA_IRAM_OPT is not set
CONFIG_WIFI_RMT_RX_IRAM_OPT=y
CONFIG_WIFI_RMT_ENABLE_WPA3_SAE=y
CONFIG_WIFI_RMT_ENABLE_SAE_H2E=y
CONFIG_WIFI_RMT_ENABLE_SAE_PK=y
CONFIG_WIFI_RMT_SOFTAP_SAE_SUPPORT=y
CONFIG_WIFI_RMT_ENABLE_WPA3_OWE_STA=y
# default:
CONFIG_WIFI_RMT_WPA3_COMPATIBLE_SUPPORT=y
# CONFIG_WIFI_RMT_SLP_IRAM_OPT is not set
CONFIG_WIFI_RMT_SLP_DEFAULT_MIN_ACTIVE_TIME=50
CONFIG_WIFI_RMT_BSS_MAX_IDLE_SUPPORT=y
CONFIG_WIFI_RMT_SLP_DEFAULT_MAX_ACTIVE_TIME=10
CONFIG_WIFI_RMT_SLP_DEFAULT_WAIT_BROADCAST_DATA_TIME=15
# CONFIG_WIFI_RMT_FTM_ENABLE is not set
CONFIG_WIFI_RMT_STA_DISCONNECTED_PM_ENABLE=y
# CONFIG_WIFI_RMT_GCMP_SUPPORT is not set
CONFIG_WIFI_RMT_GMAC_SUPPORT=y
CONFIG_WIFI_RMT_SOFTAP_SUPPORT=y
# CONFIG_WIFI_RMT_SLP_BEACON_LOST_OPT is not set
CONFIG_WIFI_RMT_ESPNOW_MAX_ENCRYPT_NUM=7
# default:
# CONFIG_WIFI_RMT_NAN_USD_ENABLE is not set
CONFIG_WIFI_RMT_MBEDTLS_CRYPTO=y
CONFIG_WIFI_RMT_MBEDTLS_TLS_CLIENT=y
# CONFIG_WIFI_RMT_EAP_TLS1_3 is not set
# CONFIG_WIFI_RMT_WAPI_PSK is not set
# CONFIG_WIFI_RMT_SUITE_B_192 is not set
# CONFIG_WIFI_RMT_11KV_SUPPORT is not set
# CONFIG_WIFI_RMT_MBO_SUPPORT is not set
# CONFIG_WIFI_RMT_ENABLE_ROAMING_APP is not set
# CONFIG_WIFI_RMT_DPP_SUPPORT is not set
# CONFIG_WIFI_RMT_11R_SUPPORT is not set
# CONFIG_WIFI_RMT_WPS_SOFTAP_REGISTRAR is not set
# CONFIG_WIFI_RMT_ENABLE_WIFI_TX_STATS is not set
# CONFIG_WIFI_RMT_ENABLE_WIFI_RX_STATS is not set
CONFIG_WIFI_RMT_TX_HETB_QUEUE_NUM=3

#
# WPS Configuration Options
#
# CONFIG_WIFI_RMT_WPS_STRICT is not set
# CONFIG_WIFI_RMT_WPS_PASSPHRASE is not set
# CONFIG_WIFI_RMT_WPS_RECONNECT_ON_FAIL is not set
# end of WPS Configuration Options

